<?php ## Перебор списка.
//Косвенный перебор элментов массива

  $dos = [
    ["name" => "Антон Антонович", "born" => "2020-03-11"],
    ["name" => "Сергей Сергеевич",    "born" => "2020-09-02"],
  ];
  for($i = 0; $i < count($dos); $i++)
    echo "{$dos[$i]['name']} родились {$dos[$i]['born']}<br />";

//// Пусть $namesL - список имен. Распечатаем их в столбик
//for ($i = 0; $i < count($namesL); $i++)
//  echo $namesL[$i]."\n";
////
//for ($i = 0; $i < count($namesL); $i++)
//  echo "$namesL[$i]\n";

?>
